/**
 * ЗАДАНИЯ
 */

/**
 * 1. Добавить в БД 10 записей следующего формата
 * 
{
    firstName: String,
    lastName: String,
    birthday: Date,
    gender: String,
    created: Number
}
 */


/**
 * 2. Обновить все записи. Добавить новое поле role = 'user'
 */

/**
 * 3. Добавить одного пользователя следующего формата
{
    firstName: 'Admin',
    lastName: '',
    birthday: Date,
    gender: String,
    role: 'admin'
    created: Number
}
 */

/**
 * 4. Найти всех пользователей мужского пола
 */

/**
 * 5. Найти всех пользователей женского пола
 */

/**
 * 6. Найти пользователя с ролью admin
 */

/**
 * 7. Удалить всех пользователей, чье имя начинается с гласной буквы
 */

/**
 * 8. Посчитать сколько пользователей осталось в БД
 */

/**
 * 9. Обновить всех пользователей, добавить поле goods в виде массива из 3-4 цифр
 * пример
 * [1,7,3,9]
 */

/**
 * 10. Найти всех пользователей, которые содержат в массиве goods либо 2 либо 7
 */

/**
 * 11. Обновить одного пользователей, который содержит в goods 6, установить ему firstName = 'six'
 */

/**
 * 12. Обновить всех пользователей, добавить всем пользователям поле "settings" в формате
{
    receiveNotification: Boolean
}
 */

/**
 * 13. Удалить всех пользователей, у которых поле receiveNotification = true
 */

/**
 * 14. Удалить всех пользователей
 */

/**
 * 15. Найти всех пользователей
 */