/**
 * Задание. Даны 2 числа. Необходимо посчитать сумму чисел, которые находятся в промежутке между этими числа
 * включая граничные.
 * Если числа совпадают то вернуть одно из них
 * Примеры:
 *   getSum(1, 0) == 1   // 1 + 0 = 1
 *   getSum(1, 2) == 3   // 1 + 2 = 3
 *   getSum(0, 1) == 1   // 0 + 1 = 1
 *   getSum(1, 1) == 1   // 1
 *   getSum(-1, 0) == -1 // -1 + 0 = -1
 *   getSum(-1, 2) == 2  // -1 + 0 + 1 + 2 = 2
 */

function getSum(a, b) {

}

//  Тесты
console.assert(getSum(1, 0) == 1, 'должно быть 1');
console.assert(getSum(1, 2) == 3, 'должно быть 3');
console.assert(getSum(0, 1) == 1, 'должно быть 1');
console.assert(getSum(1, 1) == 1, 'должно быть 1');
console.assert(getSum(-1, 0) == -1, 'должно быть -1');
console.assert(getSum(-1, 2) == 2, 'должно быть 2');



