/**
 * Задание. Написать функцию, которая принимает в качестве аргумента строку из одного
 * слова и возвращает в качестве результата центральные символ/символы этой строки
 * Если строка имеет четную длину, вернуть два центральных элемента
 * Если строка имеет нечетную длину, вернуть один центральный символ
 * 
 * Примеры:
 * getMiddle("Мир") => return "и"
 * getMiddle("шалаш") => return "л"
 * getMiddle("машина") => return "ши"
 * getMiddle("A") => return "A"
 */

function getMiddle(str) {

}

console.assert(getMiddle("Мир") == "и", 'должно быть и');
console.assert(getMiddle("шалаш") == "л", 'должно быть л');
console.assert(getMiddle("машина") == "ши", 'должно быть ши');
console.assert(getMiddle("A") == "A", 'должно быть A');