/**
 * Задание. Найти длину самого короткого слова в тексте
 * Написать функцию findShort, которая принимает строчку
 */



function findShort(str){
}

//  Тесты

console.assert(findShort('Высокий уровень вовлечения представителей целевой аудитории является четким доказательством простого факта') == 5, 'факта - 5');
console.assert(findShort('Акционеры крупнейших компаний и по сей день остаются уделом либералов, которые жаждут быть ассоциативно распределены по отраслям.') == 1, 'и - 1');
console.assert(findShort('Давайте не забывать, что новая модель организационной деятельности расставила все точки над i') == 1, 'i - 1');
