/*
Задание.
Написать 3 функции. для задания 26

1) getListOfUser Функция получения пользователей по фильтру
Первый аргумент - фильтр поиска
Второй аргумент - смещение в выборке
Третий аргумент - количество записей в результате

2) getNumberOfUser - функция получения количество записей по фильтру
Первый аргумент - фильтр

3) getAggregateListOfUser - функция получения списка пользователей и их количества всего в целом
по фильтру
Первый аргумент - фильтр поиска
Второй аргумент - смещение в выборке
Третий аргумент - количество записей в результате

*/

function getListOfUser(filter, skip, limit) {

}

function getNumberOfUser(filter) {

}

function getAggregateListOfUser(filter, skip, limit) {
    
}