/*
    Задание. Даны точки треугольника A(xA,yA), B(xB,yB), C(xC,yC).
    Необходимо написать программу, которая :
    1) Производит вычисление длин сторон треугольника по данным точкам
    2) Нахождит высоту, проведенной из большего угла. 
    В случае каких-либо ошибок (точки задают не корректный треугольник) необходимо вывести соответствующее сообщение в консоль.
    Все данные(длины сторон и высота) должны быть выведены в консоль с точностью до 4 порядка
*/

let xA;
let yA;
let xB;
let yB;
let xC;
let yC;

