/*
    Задание. Есть текст text. Необходимо составить таблицу символов в данном тексте.
    В данной таблице должно отображаться:
        1) Символ
        2) Количество повторений в тексте
    В конце вывести самую распространенный символ
*/

let text = "Предварительные выводы неутешительны: высокое качество позиционных исследований, в своём классическом представлении, допускает внедрение экспериментов, поражающих по своей масштабности и грандиозности. Прежде всего, новая модель организационной деятельности позволяет выполнить важные задания по разработке системы обучения кадров, соответствующей насущным потребностям. Явные признаки победы институционализации, превозмогая сложившуюся непростую экономическую ситуацию, описаны максимально подробно. Банальные, но неопровержимые выводы, а также базовые сценарии поведения пользователей, превозмогая сложившуюся непростую экономическую ситуацию, призваны к ответу. Таким образом, базовый вектор развития, в своём классическом представлении, допускает внедрение форм воздействия. В целом, конечно, убеждённость некоторых оппонентов предполагает независимые способы реализации дальнейших направлений развития. Приятно, граждане, наблюдать, как сделанные на базе интернет-аналитики выводы указаны как претенденты на роль ключевых факторов.Равным образом, повышение уровня гражданского сознания создаёт необходимость включения в производственный план целого ряда внеочередных мероприятий с учётом комплекса поставленных обществом задач! А ещё активно развивающиеся страны третьего мира, которые представляют собой яркий пример континентально-европейского типа политической культуры, будут призваны к ответу.";

