/**
 * Дезоксирибонуклеиновая кислота (ДНК) - это химическое вещество, 
 * обнаруженное в ядре клеток и несущее «инструкции» для развития и функционирования живых организмов.
 * В цепочках ДНК символы «A» и «T» дополняют друг друга, как «C» и «G». 
 * 
 * Задание.
 * Написать программу, состоящей из функции, которая преобразует ДНК в РНК (правила преобразования в гугле);
 * Условия:
 *      1. ДНК - строка, состоящая из элементов A, T, C, G
 *      2. ДНК никогда не бывает пустой. То есть считаем что цепочка из нуклеотидов (A,T,C,G) ДНК имеет длину минимум в 1 символ
 * 
 * Пример
 * 
 * getRNAfromDNA("ATTGC")  => "TAACG"
 * getRNAfromDNA("GTAT")  => "CATA"
 */