/**
 * Любое число задается один или несколькими цифрами.
 * 
 * Задание.
 * Написать программу, которая складывает сумму цифр заданного числа (number) и выводит результирующую ЦИФРУ в консоль
 * Если получилось ЧИСЛО, а не цифра, производить сложение цифр полученного числа, до тех пор, пока не получится цифра
 * 
 * Условия:
 *      1.  Число всегда положительное
 *      2.  Число может быть изначально цифрой
 *      3.  Число всегда задано, оно является конечным и счетным
 * 
 * Пример
 * 16   -->  1 + 6 --> 7  (вывод 7)
 * 942  -->  9 + 4 + 2 = 15 (это еще число) -->  1 + 5 = 6 (вывод 6)
 * 132189  -->  1 + 3 + 2 + 1 + 8 + 9 = 24  -->  2 + 4 = 6
 */

let number = 1732;